In [3]:
import pandas as pd

# Sample DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 30, 35, 40, 45],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Seattle']
}

df = pd.DataFrame(data)
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston
4      Eva   45      Seattle

In [5]:
row = df.loc[2]
row

Name    Charlie
Age          35
City    Chicago
Name: 2, dtype: object

In [6]:
row = df.loc[2]
row

Name    Charlie
Age          35
City    Chicago
Name: 2, dtype: object

In [8]:
cell = df.loc[3, 'City']
cell

'Houston'

In [10]:
subset_rows = df.loc[1:3]
subset_rows

      Name  Age         City
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston

In [12]:
subset_rows = df.loc[1:4, ['Name', 'City']]
subset_rows

      Name         City
1      Bob  Los Angeles
2  Charlie      Chicago
3    David      Houston
4      Eva      Seattle

In [13]:
mask = df['Age'] > 30
filetered = df.loc[mask].iloc[:,0]
filetered

2    Charlie
3      David
4        Eva
Name: Name, dtype: object

In [14]:
df.iloc[0]

Name       Alice
Age           25
City    New York
Name: 0, dtype: object

In [15]:
df.iloc[1:4]

      Name  Age         City
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston